# DefinitionBindingMap Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefinitionBindingMap Members
DefinitionBindingMap Class Constructors Methods Properties See Also
---
The DefinitionBindingMap type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DefinitionBindingMap | Initializes a new instance of the DefinitionBindingMap class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear | Removes every binding from the map, rendering it empty. |
| Contains |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| Erase |
| ForwardIterator | Retrieve a forward moving iterator to the map. |
| GetEnumerator | Retrieve a forward moving iterator to the map. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Insert |
| ReverseIterator | Retrieve a backward moving iterator to the map. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the map is empty. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| Item |
| Size | Returns the number of bindings that are in the map. |

# See Also
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace